export type Article = {
    id: number
    title: string
    description: string
    content: string
    image: string
    category?: string
    fulldescription: string
}
const articlesArray: Article[] = [
    {
        id: 1,
        title: 'Чандра Намаскар. Приветствие луне для начинающих. ',
        description: 'Oдна из самых действенных практик  перед сном.',
        content: 'Как правильно выполнять?',
        fulldescription:
            '<div class="article">Практика Чандра Намаскар помогает восстановить энергетический баланс, считается, что она идеально подходит тем людям, которые часто подвергаются стрессу.В некоторых источниках утверждают, что Чандра Намаскар состоит из 14 асан. А в древних тантрических текстах описываются 16 положений тела. В любом случае, все источники указывают на связь поз с фазами Луны. <img src="/images/moon.png" alt="#" width=600 px height=400 px /></div>',
        image: '/images/moon.png',
        category: 'practice',
    },
    {
        id: 2,
        title: 'Де проходить принципова межа між спортом та йогою? ',
        description: 'Чому їх можна поєднювати, але ніколи не варто змішувати?',
        content: 'Йога допускає можливість робити асани неідеально',
        fulldescription:
            '<div class="article">Спорт - це про якості та адаптацію. Його ціль - піднести те, що ви вже вмієте, до рекордних висот. А йога - це про навички та функції. ЇЇ мета - не відтворити максимально можливу форму, а знайти точку втрати контролю над нею. Ваші фізичні якості можна виміряти у лабораторії: об"єм м"язової маси, швидкість хімічних процесів та функційні тексти. Щоб покращити показники, потрібно розрахувати поточні дані, межеве безпечне навантаження та фази відновлення.<img src="/images/sport.jpg" alt="#" width=600 px height=400 px /></div>',
        image: '/images/sport.jpg',
        category: 'practice',
    },
    {
        id: 3,
        title: 'Философия – это любовь к мудрости. Философия Йоги – это альтруизм и любовь к естественной природе.',
        description:
            'Йога - это совокупность физических и духовных практик, направленных на развитие человека на всех уровнях: психическом, духовном и физическом.',
        content:
            'Йога - система упражнений для успокоения мятущегося ума и направления энергии в конструктивные каналы.',
        fulldescription:
            '<div class="article">Она духовна, т.е. ориентирована на раскрытие и постижения бытия при помощи осознания независимого и самосущего Духа личности. Этична, т.е. содержит в себе добродетели, главной из которых является ненасилие. Эмоциональна, т.е. учит о любви, доброте и других благодетельных качествах. Практична, т. е. предлагает способы управления телом. Интеллектуальна, т.е. ее методы предполагают использование сил разума, а основные положения обоснованы философскими текстами.<img src="/images/philosophy.jpg" alt="#" width=600 px height=400 px /></div>',
        image: '/images/philosophy.jpg',
        category: 'philosophy',
    },
    {
        id: 4,
        title: 'Правильне харчування для йогів-початківців: режим і основні принципи. ',
        description:
            'Їжа - це не культ насолоди, а засіб існування, тому дієта повинна включати лише необхідну кількість їжі.',
        content:
            'Основу раціону йогів становлять такі продукти: молоко, мед, горіхи, свіжі овочі, фрукти та ягоди, зелень, крупи.',
        fulldescription:
            '<div class="article">Краще віддавати перевагу рослинній їжі, що зазнала мінімальної термічної обробки, або навіть сирої. Варто помістити в основу раціону овочі та фрукти, однак м"ясо не є табу. Обмеження на м"ясо накладається через те, в яких умовах живуть і вмирають тварини, перед тим як потрапити на стіл. Вважається, що страх, який відчуває тварину перед забоєм, передається її м"ясу, через що продукт несе негативну енергетику, і тому небажаний до вживання. Хоча б один прийом їжі в день повинен бути повністю рослинним. На обід, наприклад, можна з"їсти овочевий салат. Поварена сіль небажана в харчуванні. Рекомендується обмежити її кількість або ж замінити морський, багатий мінералами і йодом. Необхідно виключити наркотичні речовини з раціону. Причому до них відносяться не тільки наркотики в традиційному розумінні, але також кава, чай, шоколад. Ці продукти підвищують збудливість нервової системи і викликають звикання.Борошняні вироби можна вживати, але в невеликій кількості і тільки з борошна грубого помолу. Найкраще віддавати перевагу житньому хлібу або чорному хлібу з відбитками. Молоко - найкращий друг йога. Воно не вважається тваринним продуктом, але містить велику кількість легкоусвояемих тварин білків, які необхідні організму. Молоко може становити один повноцінний прийом їжі, можна навіть раз на тиждень проводити молочний день, коли не вживається нічого, крім цього продукту. Бажано, щоб харчування було регулярним і прийоми їжі відбувалися приблизно в один і той же час. Однак якщо час настав, а їсти не хочеться, то не варто себе змушувати, краще пропустити цей прийом.<img src="/images/meal.jpg" alt="#" width=600 px height=400 px /></div>',
        image: '/images/meal.jpg',
        category: 'nutritional',
    },
    {
        id: 5,
        title: 'Топ-30 асан для початківців: добірка вправ з йоги',
        description:
            'Йога розвиває гнучкість, координацію і баланс, робить тіло красивим, сильним і здоровим. Також ця древня індійська практика допомагає впоратися із захворюваннями хребта, стресом, втомою та іншими поширеними проблемами сучасної людини.',
        content:
            'Якщо ви давно мрієте освоїти йогу, то в нашій добірці ви знайдете кращі асани для початківців, які можна виконувати при будь-якому рівні фізичної підготовки.',
        fulldescription:
            '<div class="article">Якщо ви давно мрієте освоїти йогу, то в нашій добірці ви знайдете кращі асани для початківців, які можна виконувати при будь-якому рівні фізичної підготовки. Топ-30 асан для початківців: добірка вправ з йоги "Топ-30 асан для початківців: добірка вправ з йоги" <img src="/images/asans.webp" alt="#" width=600 px height=400 px /> </div>',
        image: '/images/asans.webp',
        category: 'practice',
    },
    {
        id: 6,
        title: 'Сarpathian Yoga Fest 2023 Izki 10-15 вересня – дихай глибоко, дивись ясно, вчися у найкращих!',
        description:
            'Палітра стилів йоги, еліта майстрів, багатогранність занять – розширюйте світогляд разом із нами та вибирайте те, що припало до душі найбільше.',
        content:
            'Масштабне свято йоги в первозданній красі Карпат. Оживляюча сила музики і мантр, природа, пізнання, відновлення – йога квінтесенція року чекає вас! В цьому році за музичний і розважальний дух фестивалю відповідають найцікавіші гурти з України',
        fulldescription:
            '<div class="article">Для тих, хто прагне покращити рівень, знайти нові знання та інсайти від професіоналів. Інтенсивне навчання, яке допоможе отримати відповіді на внутрішні питання та енергетичний сплеск. Насичені заняття для тих, хто прагне зростання та розвитку. Набуті знання підтверджуються сертифікатом. <img src="/images/carpathians.jpg" alt="#" width=600 px height=400 px /></div>',
        image: '/images/carpathians.jpg',
        category: 'yogatours',
    },
]
export const getArticlesObject = (array: Article[]) =>
    array.reduce(
        (object, article) => ({
            ...object,
            [article.id]: article,
        }),
        {}
    )

export default articlesArray
